import geopandas as gpd
from shapely.geometry import box

def get_zones_gdf() -> gpd.GeoDataFrame:
    """maritime_density와 maritime_speed 등에서 공통으로 사용할 군사 작전 해역 GeoDataFrame을 생성합니다."""
    
    # 관심 군사 작전 해역 정의
    zone_configs = {
        'Zone_16':   [125.00, 34.40, 125.50, 36.00, '서해 남부 외해'],
        'Zone_5':    [125.50, 34.40, 126.60, 36.00, '목포-신안 해역'],
        'Zone_12':   [126.60, 34.40, 127.60, 36.00, '고흥-완도 연안'],
        'Zone_3':    [127.60, 34.70, 128.00, 36.00, '광양-여수 해역'],
        'Zone_4':    [128.00, 34.70, 128.30, 36.00, '남해 중앙 연안'],
        'Zone_2':    [128.30, 34.70, 128.70, 36.00, '거제-통영 해역'],
        'Zone_1':    [128.70, 34.70, 129.30, 36.00, '부산-가덕 해역'],
        'Zone_18':   [129.30, 34.70, 130.50, 36.00, '부산외항-울산남부'],
        'Zone_14':   [130.50, 35.15, 132.50, 36.00, '울산-포항 해역'],
        'Zone_7':    [125.00, 33.00, 126.20, 34.40, '서남해 외해'],
        'Zone_8':    [126.20, 33.80, 127.60, 34.40, '제주-육지 교차로 해역'],
        'Zone_9_1':  [127.60, 33.80, 128.30, 34.70, '여수-통영 외해'],
        'Zone_9_2':  [128.30, 33.80, 128.70, 34.70, '거제-가덕 외해'],
        'Zone_9_3':  [128.70, 33.80, 129.30, 34.70, '부산-대마도 입구 해역'],
        'Zone_15_1': [129.30, 33.80, 130.50, 34.70, '대마도 남서 해역'],
        'Zone_17':   [130.50, 33.80, 131.50, 34.25, '시모노세키-기타큐슈 해역'],
        'Zone_15_2': [130.50, 34.25, 131.50, 35.15, '대마도 북동 해역'],
        'Zone_6':    [126.20, 33.40, 126.90, 33.80, '제주 북부 연안'],
        'Zone_13':   [126.20, 33.00, 126.90, 33.40, '제주 남부 연안'],
        'Zone_11':   [126.90, 33.00, 129.50, 33.80, '제주 남동부 해역'],
        'Zone_15_3': [129.50, 33.00, 131.00, 33.80, '이키-후쿠오카 연안'],
        'Zone_15_4': [131.00, 33.00, 132.50, 35.15, '일본 가이요 외해'],
        'Zone_10':   [125.00, 31.00, 132.50, 33.00, '원거리 국제공해']
    }

    polygons = [box(val[0], val[1], val[2], val[3]) for val in zone_configs.values()]
    ids = list(zone_configs.keys())
    names = [val[4] for val in zone_configs.values()]

    return gpd.GeoDataFrame({'zone_id': ids, 'name': names}, geometry=polygons, crs="EPSG:4326")
